[
    "Asian Institute of Technology",
    "Asia-Pacific International University",
    "Phranakhon Si Ayutthaya Rajabhat University",
    "Asian University of Science and Technology",
    "Assumption University of Thailand",
    "Bangkok University",
    "Burapha University",
    "Chiang Mai University",
    "Rajamangala University of Technology, Lanna Chiang Rai",
    "Chulalongkorn University",
    "Chiang Mai Rajabhat University",
    "Chiang Mai Vocational College",
    "Chaopraya University",
    "Dhurakijpundit University",
    "Suan Dusit Rajabhat University",
    "Eastern Asia University",
    "Asian University",
    "Huachiew Chalermprakiet University",
    "Hatyai University",
    "International Buddhist College",
    "Kasem Bundit University",
    "Khon Kaen University",
    "King Mongkut's Institute of Technology Ladkrabang",
    "King Mongkut's University of Technology North Bangkok",
    "King Mongkut's University of Technology Thonburi",
    "Krirk University",
    "Kasetsart University",
    "Lampang Vocational College",
    "Lamphun College of Agriculture and Technology",
    "Lampang College of Commerce and Technology",
    "Lampang Rajabhat University",
    "Mahidol University",
    "Mahamakut Buddhist University",
    "Mahachulalongkorn Buddhist University",
    "Mae Fah Luang University",
    "Maejo University",
    "Mahasarakham University",
    "Mahidol University International College",
    "Mahanakorn University of Technology",
    "Rajamangala University of Technology, Lanna Nan",
    "National Institute of Development Administration",
    "Navrachana University",
    "Nivadhana University",
    "Naresuan University",
    "Payap University Chaiang Mai",
    "Prince of Songkla University",
    "Pathumthani University",
    "Rajamangala University of Technology, Phra Nakhon",
    "Rangsit University",
    "Ramkhamhaeng University",
    "South-East Asia University",
    "Shinawatra University",
    "Siam University",
    "Sripatum University",
    "Stamford International University",
    "St. John's University",
    "Sukhothai Thammathirat Open University",
    "Silpakorn University",
    "Suranaree University of Technology",
    "Srinakharinwirot University",
    "Thaksin University",
    "Thammasat University",
    "Ubonratchathani University",
    "University of the Thai Chamber of Commerce",
    "Vongchavalitkul University",
    "Webster University, Thailand",
    "Walailak University",
    "Nation University",
    "มหาวิทยาลัยกาฬสินธุ์",
    "มหาวิทยาลัยนครพนม",
    "มหาวิทยาลัยนราธิวาสราชนครินทร์",
    "มหาวิทยาลัยนเรศวร",
    "มหาวิทยาลัยมหาสารคาม",
    "มหาวิทยาลัยรามคำแหง",
    "มหาวิทยาลัยสุโขทัยธรรมาธิราช",
    "มหาวิทยาลัยอุบลราชธานี",
    "สถาบันบัณฑิตพัฒนบริหารศาสตร์",
    "สถาบันเทคโนโลยีปทุมวัน",
    "มหาวิทยาลัยราชภัฏกาญจนบุรี",
    "มหาวิทยาลัยราชภัฏกำแพงเพชร",
    "มหาวิทยาลัยราชภัฏจันทรเกษม",
    "มหาวิทยาลัยราชภัฏชัยภูมิ",
    "มหาวิทยาลัยราชภัฏเชียงราย",
    "มหาวิทยาลัยราชภัฏเชียงใหม่",
    "มหาวิทยาลัยราชภัฏเทพสตรี",
    "มหาวิทยาลัยราชภัฏธนบุรี",
    "มหาวิทยาลัยราชภัฏนครปฐม",
    "มหาวิทยาลัยราชภัฏนครราชสีมา",
    "มหาวิทยาลัยราชภัฏนครศรีธรรมราช",
    "มหาวิทยาลัยราชภัฏนครสวรรค์",
    "มหาวิทยาลัยราชภัฏบ้านสมเด็จเจ้าพระยา",
    "มหาวิทยาลัยราชภัฏบุรีรัมย์",
    "มหาวิทยาลัยราชภัฏพระนคร",
    "มหาวิทยาลัยราชภัฏพระนครศรีอยุธยา",
    "มหาวิทยาลัยราชภัฏพิบูลสงคราม",
    "มหาวิทยาลัยราชภัฏเพชรบุรี",
    "มหาวิทยาลัยราชภัฏเพชรบูรณ์",
    "มหาวิทยาลัยราชภัฏภูเก็ต",
    "มหาวิทยาลัยราชภัฏมหาสารคาม",
    "มหาวิทยาลัยราชภัฏยะลา",
    "มหาวิทยาลัยราชภัฏร้อยเอ็ด",
    "มหาวิทยาลัยราชภัฏราชนครินทร์",
    "มหาวิทยาลัยราชภัฏรำไพพรรณี",
    "มหาวิทยาลัยราชภัฏลำปาง",
    "มหาวิทยาลัยราชภัฏเลย",
    "มหาวิทยาลัยราชภัฏวไลยอลงกรณ์ ในพระบรมราชูปถัมภ์",
    "มหาวิทยาลัยราชภัฏศรีสะเกษ",
    "มหาวิทยาลัยราชภัฏสกลนคร",
    "มหาวิทยาลัยราชภัฏสงขลา",
    "มหาวิทยาลัยราชภัฏสวนสุนันทา",
    "มหาวิทยาลัยราชภัฏสุราษฎร์ธานี",
    "มหาวิทยาลัยราชภัฏสุรินทร์",
    "มหาวิทยาลัยราชภัฏหมู่บ้านจอมบึง",
    "มหาวิทยาลัยราชภัฏอุดรธานี",
    "มหาวิทยาลัยราชภัฏอุตรดิตถ์",
    "มหาวิทยาลัยราชภัฏอุบลราชธานี",
    "มหาวิทยาลัยเทคโนโลยีราชมงคลกรุงเทพ",
    "มหาวิทยาลัยเทคโนโลยีราชมงคลตะวันออก",
    "มหาวิทยาลัยเทคโนโลยีราชมงคลธัญบุรี",
    "มหาวิทยาลัยเทคโนโลยีราชมงคลพระนคร",
    "มหาวิทยาลัยเทคโนโลยีราชมงคลรัตนโกสินทร์",
    "มหาวิทยาลัยเทคโนโลยีราชมงคลล้านนา",
    "มหาวิทยาลัยเทคโนโลยีราชมงคลศรีวิชัย",
    "มหาวิทยาลัยเทคโนโลยีราชมงคลสุวรรณภูมิ",
    "มหาวิทยาลัยเทคโนโลยีราชมงคลอีสาน",
    "สถาบันการอาชีวศึกษาเกษตรภาคเหนือ",
    "สถาบันการอาชีวศึกษาเกษตรภาคใต้",
    "สถาบันการอาชีวศึกษาเกษตรภาคกลาง",
    "สถาบันการอาชีวศึกษาเกษตรภาคตะวันออกเฉียงเหนือ",
    "สถาบันการอาชีวศึกษากรุงเทพมหานคร",
    "สถาบันการอาชีวศึกษาภาคเหนือ ๑",
    "สถาบันการอาชีวศึกษาภาคเหนือ ๒",
    "สถาบันการอาชีวศึกษาภาคเหนือ ๓",
    "สถาบันการอาชีวศึกษาภาคเหนือ ๔",
    "สถาบันการอาชีวศึกษาภาคใต้ ๑",
    "สถาบันการอาชีวศึกษาภาคใต้ ๒",
    "สถาบันการอาชีวศึกษาภาคใต้ ๓",
    "สถาบันการอาชีวศึกษาภาคกลาง ๑",
    "สถาบันการอาชีวศึกษาภาคกลาง ๒",
    "สถาบันการอาชีวศึกษาภาคกลาง ๓",
    "สถาบันการอาชีวศึกษาภาคกลาง ๔",
    "สถาบันการอาชีวศึกษาภาคกลาง ๕",
    "สถาบันการอาชีวศึกษาภาคตะวันออก",
    "สถาบันการอาชีวศึกษาภาคตะวันออกเฉียงเหนือ ๑",
    "สถาบันการอาชีวศึกษาภาคตะวันออกเฉียงเหนือ ๒",
    "สถาบันการอาชีวศึกษาภาคตะวันออกเฉียงเหนือ ๓",
    "สถาบันการอาชีวศึกษาภาคตะวันออกเฉียงเหนือ ๔",
    "สถาบันการอาชีวศึกษาภาคตะวันออกเฉียงเหนือ ๕",
    "โรงเรียนนายร้อยตำรวจ",
    "โรงเรียนนายร้อยพระจุลจอมเกล้า",
    "โรงเรียนนายเรือ",
    "โรงเรียนนายเรืออากาศนวมินทกษัตริยาธิราช",
    "วิทยาลัยพยาบาลกองทัพบก",
    "วิทยาลัยพยาบาลกองทัพเรือ",
    "วิทยาลัยพยาบาลตำรวจ",
    "วิทยาลัยพยาบาลทหารอากาศ",
    "วิทยาลัยแพทยศาสตร์พระมงกุฎเกล้า",
    "วิทยาลัยการชลประทาน",
    "สถาบันการบินพลเรือน",
    "สถาบันการพลศึกษา",
    "สถาบันบัณฑิตพัฒนศิลป์",
    "สถาบันพระบรมราชชนก",
    "ศูนย์ฝึกพาณิชย์นาวี",
    "มหาวิทยาลัยเกษตรศาสตร์",
    "มหาวิทยาลัยขอนแก่น",
    "จุฬาลงกรณ์มหาวิทยาลัย",
    "มหาวิทยาลัยเชียงใหม่",
    "มหาวิทยาลัยทักษิณ",
    "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าธนบุรี",
    "มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ",
    "มหาวิทยาลัยเทคโนโลยีสุรนารี",
    "มหาวิทยาลัยธรรมศาสตร์",
    "มหาวิทยาลัยนวมินทราธิราช",
    "มหาวิทยาลัยบูรพา",
    "มหาวิทยาลัยพะเยา",
    "มหาวิทยาลัยมหาจุฬาลงกรณราชวิทยาลัย",
    "มหาวิทยาลัยมหามกุฏราชวิทยาลัย",
    "มหาวิทยาลัยมหิดล",
    "มหาวิทยาลัยแม่โจ้",
    "มหาวิทยาลัยแม่ฟ้าหลวง",
    "มหาวิทยาลัยวลัยลักษณ์",
    "มหาวิทยาลัยศรีนครินทรวิโรฒ",
    "มหาวิทยาลัยศิลปากร",
    "มหาวิทยาลัยสงขลานครินทร์",
    "มหาวิทยาลัยสวนดุสิต",
    "สถาบันการพยาบาลศรีสวรินทิรา สภากาชาดไทย",
    "สถาบันดนตรีกัลยาณิวัฒนา",
    "สถาบันเทคโนโลยีพระจอมเกล้าเจ้าคุณทหารลาดกระบัง",
    "สถาบันบัณฑิตศึกษาจุฬาภรณ์",
    "วิทยาลัยวิทยาศาสตร์การแพทย์เจ้าฟ้าจุฬาภรณ์",
    "มหาวิทยาลัยกรุงเทพสุวรรณภูมิ",
    "มหาวิทยาลัยการจัดการและเทคโนโลยีอีสเทิร์น",
    "มหาวิทยาลัยเกริก",
    "มหาวิทยาลัยเกษมบัณฑิต",
    "มหาวิทยาลัยคริสเตียน",
    "มหาวิทยาลัยเฉลิมกาญจนา",
    "มหาวิทยาลัยตาปี",
    "มหาวิทยาลัยเจ้าพระยา",
    "มหาวิทยาลัยชินวัตร",
    "มหาวิทยาลัยเซนต์จอห์น",
    "มหาวิทยาลัยเทคโนโลยีมหานคร",
    "มหาวิทยาลัยธนบุรี",
    "มหาวิทยาลัยธุรกิจบัณฑิตย์",
    "มหาวิทยาลัยนอร์ทกรุงเทพ",
    "มหาวิทยาลัยนอร์ท-เชียงใหม่",
    "มหาวิทยาลัยนานาชาติแสตมฟอร์ด",
    "มหาวิทยาลัยนานาชาติเอเชีย-แปซิฟิก",
    "มหาวิทยาลัยเนชั่น",
    "มหาวิทยาลัยปทุมธานี",
    "มหาวิทยาลัยพายัพ",
    "มหาวิทยาลัยพิษณุโลก",
    "มหาวิทยาลัยฟาฏอนี",
    "มหาวิทยาลัยฟาร์อีสเทิร์น",
    "มหาวิทยาลัยภาคกลาง",
    "มหาวิทยาลัยภาคตะวันออกเฉียงเหนือ",
    "มหาวิทยาลัยรังสิต",
    "มหาวิทยาลัยรัตนบัณฑิต",
    "มหาวิทยาลัยราชธานี",
    "มหาวิทยาลัยราชพฤกษ์",
    "มหาวิทยาลัยวงษ์ชวลิตกุล",
    "มหาวิทยาลัยเว็บสเตอร์ (ประเทศไทย)",
    "มหาวิทยาลัยเวสเทิร์น",
    "มหาวิทยาลัยศรีปทุม",
    "มหาวิทยาลัยสยาม",
    "มหาวิทยาลัยหอการค้าไทย",
    "มหาวิทยาลัยหัวเฉียวเฉลิมพระเกียรติ",
    "มหาวิทยาลัยหาดใหญ่",
    "มหาวิทยาลัยอัสสัมชัญ",
    "มหาวิทยาลัยอีสเทิร์นเอเชีย",
    "มหาวิทยาลัยเอเชียอาคเนย์",
    "สถาบันกันตนา",
    "สถาบันการจัดการปัญญาภิวัฒน์",
    "สถาบันวิทยาการจัดการแห่งแปซิฟิค",
    "สถาบันการเรียนรู้เพื่อปวงชน",
    "สถาบันเทคโนโลยีไทย-ญี่ปุ่น",
    "สถาบันเทคโนโลยียานยนต์มหาชัย",
    "สถาบันเทคโนโลยีแห่งสุวรรณภูมิ",
    "สถาบันเทคโนโลยีแห่งอโยธยา",
    "สถาบันเทคโนโลยีแห่งเอเชีย",
    "สถาบันรัชต์ภาคย์",
    "สถาบันวิทยสิริเมธี",
    "สถาบันอาศรมศิลป์",
    "วิทยาลัยเฉลิมกาญจนาระยอง",
    "วิทยาลัยเชียงราย",
    "วิทยาลัยเซนต์หลุยส์",
    "วิทยาลัยเซาธ์อีสท์บางกอก",
    "วิทยาลัยดุสิตธานี",
    "วิทยาลัยทองสุข",
    "วิทยาลัยเทคโนโลยีจิตรลดา",
    "วิทยาลัยเทคโนโลยีพนมวันท์",
    "วิทยาลัยเทคโนโลยีภาคใต้",
    "วิทยาลัยเทคโนโลยีสยาม",
    "วิทยาลัยนครราชสีมา",
    "วิทยาลัยนานาชาติเซนต์เทเรซา",
    "วิทยาลัยนานาชาติราฟเฟิลส์",
    "วิทยาลัยบัณฑิตเอเซีย",
    "วิทยาลัยพิชญบัณฑิต",
    "วิทยาลัยพุทธศาสนานานาชาติ",
    "วิทยาลัยนอร์ทเทิร์น",
    "วิทยาลัยสันตพล",
    "วิทยาลัยแสงธรรม",
    "วิทยาลัยอินเตอร์เทคลำปาง",
    "สถาบันเทคโนโลยีพระจอมเกล้า",
    "มหาวิทยาลัยนานาชาติศิรินสยาม",
    "มหาวิทยาลัยบริติช (ประเทศไทย)",
    "วิทยาลัยบัณฑิตสกลนคร",
    "วิทยาลัยพัฒนา",
    "มหาวิทยาลัยโยนก",
    "มหาวิทยาลัยราชภัฏกาฬสินธุ์",
    "มหาวิทยาลัยราชภัฏนครพนม",
    "วิทยาลัยรามาอโยธยา",
    "วิทยาลัยเทคโนโลยีราชธานีอุดร",
    "วิทยาลัยศรีโสภณ",
    "วิทยาลัยศรีอีสาน (คณาสวัสดิ์อุทิศ)",
    "มหาวิทยาลัยอีสาน",
    "มหาวิทยาลัยเอเชียน",
    "มหาวิทยาลัยรัตนบัณฑิตวิทยาศาสตร์และเทคโนโลยี",
    "มหาวิทยาลัยการกีฬาแห่งชาติ",
    "มหาวิทยาลัยชุมพร",
    "มหาวิทยาลัยตากสิน",
    "มหาวิทยาลัยเทคนิคไทย-เยอรมัน ขอนแก่น หรือมหาวิทยาลัยเทคโนโลยีไทย-เยอรมัน ขอนแก่น",
    "มหาวิทยาลัยนานาชาตินครแม่สอด",
    "มหาวิทยาลัยน่าน",
    "มหาวิทยาลัยพ่อหลวง หรือมหาวิทยาลัยประจวบคีรีขันธ์",
    "มหาวิทยาลัยพระพุทธยอดฟ้าจุฬาโลก",
    "มหาวิทยาลัยแพร่",
    "มหาวิทยาลัยมุกดาหาร เฉลิมพระเกียรติ",
    "มหาวิทยาลัยแม่ฮ่องสอน",
    "มหาวิทยาลัยสุราษฎร์ธานี",
    "มหาวิทยาลัยสุรินทร์",
    "มหาวิทยาลัยหนองคาย",
    "มหาวิทยาลัยอันดามัน",
    "มหาวิทยาลัยอุดรธานี",
    "สถาบันเทคโนโลยีจิตรลดา"
]
